Revit 2027 API
ExporterIFCUtils.GetUnscaledTransformWithoutFixOfDirection Method
Note: This API is now obsolete.
 Obtains the unscaled transform from an IfcLocalPlacement handle without fix of direction.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("This function is deprecated in Revit 2027.  Use getUnscaledTransform instead.")]
public static Transform GetUnscaledTransformWithoutFixOfDirection(
	ExporterIFC exporterIFC,
	IFCAnyHandle placement
)
<ObsoleteAttribute("This function is deprecated in Revit 2027.  Use getUnscaledTransform instead.")>
Public Shared Function GetUnscaledTransformWithoutFixOfDirection (
	exporterIFC As ExporterIFC,
	placement As IFCAnyHandle
) As Transform
public:
[ObsoleteAttribute(L"This function is deprecated in Revit 2027.  Use getUnscaledTransform instead.")]
static Transform^ GetUnscaledTransformWithoutFixOfDirection(
	ExporterIFC^ exporterIFC,
	IFCAnyHandle^ placement
)
[<ObsoleteAttribute("This function is deprecated in Revit 2027.  Use getUnscaledTransform instead.")>]
static member GetUnscaledTransformWithoutFixOfDirection :
        exporterIFC : ExporterIFC *
        placement : IFCAnyHandle -> Transform
Parameters
exporterIFC ExporterIFC
 The exporter.
placement IFCAnyHandle
 The placement handle.
Return Value
Transform
 The transform.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace